-- phpMyAdmin SQL Dump
-- version 4.5.1
-- http://www.phpmyadmin.net
--
-- 主機: 127.0.0.1
-- 產生時間： 2016-08-30 15:57:23
-- 伺服器版本: 5.5.50-log
-- PHP 版本： 7.0.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `pc_room_manger_sys`
--
CREATE DATABASE IF NOT EXISTS `pc_room_manger_sys` DEFAULT CHARACTER SET utf8 COLLATE utf8_bin;
USE `pc_room_manger_sys`;

-- --------------------------------------------------------

--
-- 資料表結構 `banned_user`
--

DROP TABLE IF EXISTS `banned_user`;
CREATE TABLE `banned_user` (
  `uid` int(11) NOT NULL,
  `user_id` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `reason` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `operator` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `banned_until` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- 資料表結構 `config`
--

DROP TABLE IF EXISTS `config`;
CREATE TABLE `config` (
  `name` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `data` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `config`
--

INSERT INTO `config` (`name`, `data`) VALUES
('system_enable', 'true'),
('telegram_api_key', '201964510:AAGe3Dp7V9gfXzdHgHOS5FVGQRTUSRtvd3w'),
('telegram_chat_id', '184782124 '),
('ban_reason', '不誠實使用電腦罪=w='),
('force_login', '123456');

-- --------------------------------------------------------

--
-- 資料表結構 `logs`
--

DROP TABLE IF EXISTS `logs`;
CREATE TABLE `logs` (
  `uid` int(11) NOT NULL,
  `time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `level` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `type` text NOT NULL,
  `details` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `operator` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `affected_people` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `logs`
--

INSERT INTO `logs` (`uid`, `time`, `level`, `type`, `details`, `operator`, `affected_people`) VALUES
(1, '2016-08-30 05:05:24', '警告', '管理員登入失敗', '[警告][2016/8/30 下午 01:05:24]使用者:s1210130因被密碼錯誤而登入失敗', 's1210130', 's1210130'),
(2, '2016-08-30 05:05:26', '警告', '管理員登入失敗', '[警告][2016/8/30 下午 01:05:26]使用者:s1210130因被密碼錯誤而登入失敗', 's1210130', 's1210130'),
(3, '2016-08-30 05:05:28', '警告', '管理員登入失敗', '[警告][2016/8/30 下午 01:05:28]使用者:s1210130因被密碼錯誤而登入失敗', 's1210130', 's1210130'),
(4, '2016-08-30 05:05:31', '警告', '管理員登入失敗', '[警告][2016/8/30 下午 01:05:31]使用者:s1210130因被密碼錯誤而登入失敗', 's1210130', 's1210130'),
(5, '2016-08-30 05:05:34', '警告', '管理員登入失敗', '[警告][2016/8/30 下午 01:05:34]使用者:s1210130因被密碼錯誤而登入失敗', 's1210130', 's1210130'),
(6, '2016-08-30 05:05:36', '警告', '管理員登入失敗', '[警告][2016/8/30 下午 01:05:36]使用者:s1210130因被密碼錯誤而登入失敗', 's1210130', 's1210130'),
(7, '2016-08-30 05:05:39', '警告', '管理員登入失敗', '[警告][2016/8/30 下午 01:05:39]使用者:s1210130因被停權而登入失敗', 's1210130', 's1210130'),
(8, '2016-08-30 05:06:51', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:06:51]使用者:s1210130登入成功', 's1210130', 's1210130'),
(9, '2016-08-30 05:06:57', '資訊', '關閉系統', '[資訊][2016/8/30 下午 01:06:57]關閉系統成功', 's1210130', 'GLOBAL'),
(10, '2016-08-30 05:07:26', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:07:26]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(11, '2016-08-30 05:07:26', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:07:26]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(12, '2016-08-30 05:09:17', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:09:17]使用者:s1210130登入成功', 's1210130', 's1210130'),
(13, '2016-08-30 05:09:23', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:09:23]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(14, '2016-08-30 05:09:23', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:09:23]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(15, '2016-08-30 05:09:53', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:09:53]使用者:s1210130登入成功', 's1210130', 's1210130'),
(16, '2016-08-30 05:10:45', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:10:45]使用者:s1210130登入成功', 's1210130', 's1210130'),
(17, '2016-08-30 05:10:52', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:10:52]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(18, '2016-08-30 05:10:52', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:10:52]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(19, '2016-08-30 05:12:37', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:12:37]使用者:s1210130登入成功', 's1210130', 's1210130'),
(20, '2016-08-30 05:12:40', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:12:40]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(21, '2016-08-30 05:12:40', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:12:40]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(22, '2016-08-30 05:13:34', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:13:34]使用者:s1210130登入成功', 's1210130', 's1210130'),
(23, '2016-08-30 05:13:58', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:13:58]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(24, '2016-08-30 05:13:58', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:13:58]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(25, '2016-08-30 05:14:24', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:14:24]使用者:s1210130登入成功', 's1210130', 's1210130'),
(26, '2016-08-30 05:14:30', '資訊', '啟動系統', '[資訊][2016/8/30 下午 01:14:30]啟動系統成功', 's1210130', 'GLOBAL'),
(27, '2016-08-30 05:14:31', '資訊', '關閉系統', '[資訊][2016/8/30 下午 01:14:31]關閉系統成功', 's1210130', 'GLOBAL'),
(28, '2016-08-30 05:16:42', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:16:42]使用者:s1210130登入成功', 's1210130', 's1210130'),
(29, '2016-08-30 05:17:01', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:17:01]使用者:s1210130登入成功', 's1210130', 's1210130'),
(30, '2016-08-30 05:17:05', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:17:05]座位: TC20701 已設定為啟用', 's1210130', 's1210130'),
(31, '2016-08-30 05:17:09', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:17:09]座位: TC20701 已設定使用者為 : s1210130', 's1210130', 's1210130'),
(32, '2016-08-30 05:17:16', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:17:16]座位: I7_DESKTOP_SSD 已設定為停用', 's1210130', 's1210130'),
(33, '2016-08-30 05:17:19', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:17:19]座位: I7_DESKTOP_SSD 已設定為啟用', 's1210130', 's1210130'),
(34, '2016-08-30 05:17:32', '資訊', '設定', '[資訊][2016/8/30 下午 01:17:32]s1210126被停權! 原因:不誠實使用電腦罪=w=', 's1210130', 's1210130'),
(35, '2016-08-30 05:17:35', '資訊', '設定', '[資訊][2016/8/30 下午 01:17:35]s1210126被停權! 原因:不誠實使用電腦罪=w=', 's1210130', 's1210130'),
(36, '2016-08-30 05:17:48', '資訊', '使用者取消停權', '[資訊][2016/8/30 下午 01:17:48]MetroTextBox5取消停權!', 's1210130', 's1210130'),
(37, '2016-08-30 05:17:57', '資訊', '使用者取消停權', '[資訊][2016/8/30 下午 01:17:57]s1210126取消停權!', 's1210130', 's1210130'),
(38, '2016-08-30 05:18:12', '資訊', '使用者取消停權', '[資訊][2016/8/30 下午 01:18:12]s1210130取消停權!', 's1210130', 's1210130'),
(39, '2016-08-30 05:18:52', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:18:52]使用者:s1210130登入成功', 's1210130', 's1210130'),
(40, '2016-08-30 05:19:21', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:19:21]座位: TC20701 已設定為啟用', 's1210130', 's1210130'),
(41, '2016-08-30 05:19:23', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:19:23]座位: TC20701 已設定使用者為 : ', 's1210130', 's1210130'),
(42, '2016-08-30 05:19:32', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:19:32]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(43, '2016-08-30 05:19:32', '資訊', '管理員登出', '[資訊][2016/8/30 下午 01:19:32]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(44, '2016-08-30 05:35:32', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:35:32]使用者:s1210130登入成功', 's1210130', 's1210130'),
(45, '2016-08-30 05:35:38', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:35:38]座位: TC20701 已設定為啟用', 's1210130', 's1210130'),
(46, '2016-08-30 05:35:39', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:35:39]座位: TC20701 已設定為停用', 's1210130', 's1210130'),
(47, '2016-08-30 05:35:39', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:35:39]座位: TC20701 已設定為啟用', 's1210130', 's1210130'),
(48, '2016-08-30 05:35:48', '資訊', '設定', '[資訊][2016/8/30 下午 01:35:48]s1210130被停權! 原因:不誠實使用電腦罪=w=', 's1210130', 's1210130'),
(49, '2016-08-30 05:35:48', '資訊', '設定', '[資訊][2016/8/30 下午 01:35:48]s1210130被停權! 原因:不誠實使用電腦罪=w=', 's1210130', 's1210130'),
(50, '2016-08-30 05:35:49', '資訊', '設定', '[資訊][2016/8/30 下午 01:35:49]s1210130被停權! 原因:不誠實使用電腦罪=w=', 's1210130', 's1210130'),
(51, '2016-08-30 05:35:50', '資訊', '設定', '[資訊][2016/8/30 下午 01:35:50]s1210130被停權! 原因:不誠實使用電腦罪=w=', 's1210130', 's1210130'),
(52, '2016-08-30 05:36:19', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:36:19]使用者:s1210130登入成功', 's1210130', 's1210130'),
(53, '2016-08-30 05:38:24', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:38:24]使用者:s1210130登入成功', 's1210130', 's1210130'),
(54, '2016-08-30 05:38:28', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:38:28]座位: TC20701 已設定為啟用', 's1210130', 's1210130'),
(55, '2016-08-30 05:38:28', '資訊', '座位設定', '[資訊][2016/8/30 下午 01:38:28]座位: TC20701 已設定為停用', 's1210130', 's1210130'),
(56, '2016-08-30 05:38:49', '資訊', '使用者取消停權', '[資訊][2016/8/30 下午 01:38:49]s1210130取消停權!', 's1210130', 's1210130'),
(57, '2016-08-30 05:40:25', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 01:40:25]使用者:s1210130登入成功', 's1210130', 's1210130'),
(59, '2016-08-30 06:01:41', '資訊', '電腦登入成功', '[資訊][2016/8/30 下午 02:01:41]系統偵測到功能停用，I7_DESKTOP_SSD將不檢查使用者名稱', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(60, '2016-08-30 06:02:46', '資訊', '管理員登入成功', '[資訊][2016/8/30 下午 02:02:46]使用者:s1210130登入成功', 's1210130', 's1210130'),
(61, '2016-08-30 06:02:49', '資訊', '啟動系統', '[資訊][2016/8/30 下午 02:02:49]啟動系統成功', 's1210130', 'GLOBAL'),
(62, '2016-08-30 06:02:52', '資訊', '管理員登出', '[資訊][2016/8/30 下午 02:02:52]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(63, '2016-08-30 06:02:52', '資訊', '管理員登出', '[資訊][2016/8/30 下午 02:02:52]管理員: s1210130 登出了系統', 's1210130', 's1210130'),
(64, '2016-08-30 06:02:59', '警告', '電腦登入失敗', '[警告][2016/8/30 下午 02:02:59]I7_DESKTOP_SSD登入失敗', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(65, '2016-08-30 06:03:05', '警告', '電腦登入成功', '[警告][2016/8/30 下午 02:03:05]I7_DESKTOP_SSD被管理員使用密碼登入，系統取消登出', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(66, '2016-08-30 06:07:02', '資訊', '電腦登入成功', '[資訊][2016/8/30 下午 02:07:02]I7_DESKTOP_SSD登入成功', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(67, '2016-08-30 06:07:35', '資訊', '電腦登入成功', '[資訊][2016/8/30 下午 02:07:35]I7_DESKTOP_SSD登入成功', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(68, '2016-08-30 06:16:44', '資訊', '電腦登出成功', '[資訊][2016/8/30 下午 02:16:44]I7_DESKTOP_SSD登出成功', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(69, '2016-08-30 06:23:55', '資訊', '電腦登出成功', '[資訊][2016/8/30 下午 02:23:55]I7_DESKTOP_SSD登出成功', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(70, '2016-08-30 06:24:17', '資訊', '電腦登出成功', '[資訊][2016/8/30 下午 02:24:17]I7_DESKTOP_SSD登出成功', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(71, '2016-08-30 13:18:27', '警告', '電腦登入失敗', '[警告][2016/8/30 下午 09:18:27]I7_DESKTOP_SSD登入失敗', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(72, '2016-08-30 13:18:38', '資訊', '電腦登入成功', '[資訊][2016/8/30 下午 09:18:38]I7_DESKTOP_SSD被管理員使用密碼登入，系統取消登出', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(73, '2016-08-30 13:22:28', '資訊', '電腦登入成功', '[資訊][2016/8/30 下午 09:22:28]I7_DESKTOP_SSD登入成功', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(74, '2016-08-30 13:22:59', '資訊', '電腦登入成功', '[資訊][2016/8/30 下午 09:22:59]I7_DESKTOP_SSD登入成功', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(75, '2016-08-30 13:25:01', '警告', '電腦登入失敗', '[警告][2016/8/30 下午 09:25:01]I7_DESKTOP_SS登入失敗', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN'),
(76, '2016-08-30 13:25:10', '資訊', '電腦登入成功', '[資訊][2016/8/30 下午 09:25:10]I7_DESKTOP_SS被管理員使用密碼登入，系統取消登出', 'SYSTEM_ADMIN', 'SYSTEM_ADMIN');

-- --------------------------------------------------------

--
-- 資料表結構 `seat`
--

DROP TABLE IF EXISTS `seat`;
CREATE TABLE `seat` (
  `computer_name` text COLLATE utf8_bin NOT NULL,
  `borrowed_by` text COLLATE utf8_bin NOT NULL,
  `borrowed` text COLLATE utf8_bin NOT NULL,
  `logout_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `enabled` text COLLATE utf8_bin NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 資料表的匯出資料 `seat`
--

INSERT INTO `seat` (`computer_name`, `borrowed_by`, `borrowed`, `logout_time`, `enabled`) VALUES
('TC20701', '', '0', '1999-12-31 16:00:00', '0'),
('I7_DESKTOP_SSD', 'SYSTEM_ADMIN', '1', '2016-08-30 06:24:17', '1'),
('TC20702', '', '0', '1999-12-31 16:00:00', '1');

-- --------------------------------------------------------

--
-- 資料表結構 `user`
--

DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `user` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '使用者名稱(AD)',
  `nickname` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `level` text CHARACTER SET utf8 COLLATE utf8_bin NOT NULL COMMENT '權限',
  `enabled` int(1) NOT NULL COMMENT '停用(0),啟用(1)',
  `pwd_attempt` int(11) NOT NULL,
  `attend` text NOT NULL,
  `logined` text NOT NULL,
  `last_login` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 資料表的匯出資料 `user`
--

INSERT INTO `user` (`user`, `nickname`, `level`, `enabled`, `pwd_attempt`, `attend`, `logined`, `last_login`) VALUES
('administrator', '', 'admin', 1, 0, '1,2,3,4,5,6,7,8,9,0', 'false', '2016-08-17 05:10:12'),
('s1210130', '', 'debug', 1, 0, '1,2,3,4,5,6,0', 'false', '2016-08-30 06:02:52'),
('echo', '', 'admin', 1, 0, '', 'false', '0000-00-00 00:00:00'),
('itprefect', '', 'user', 1, 0, '', 'false', '0000-00-00 00:00:00'),
('abc', '', 'admin', 1, 0, '1,2,3', 'false', '0000-00-00 00:00:00');

-- --------------------------------------------------------

--
-- 資料表結構 `warning_page`
--

DROP TABLE IF EXISTS `warning_page`;
CREATE TABLE `warning_page` (
  `uid` int(11) NOT NULL COMMENT 'UID',
  `user_type` text COLLATE utf8_bin NOT NULL COMMENT '使用者類別',
  `details` mediumtext COLLATE utf8_bin NOT NULL COMMENT '資料',
  `operator` mediumtext COLLATE utf8_bin NOT NULL,
  `affected_people` mediumtext COLLATE utf8_bin NOT NULL COMMENT '影響人士',
  `warning_given` mediumtext COLLATE utf8_bin NOT NULL COMMENT '獲得的警告次數',
  `total_warning` int(11) NOT NULL COMMENT '累計警告',
  `banned` mediumtext COLLATE utf8_bin NOT NULL COMMENT '是否因此被Ban'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

--
-- 資料表的匯出資料 `warning_page`
--

INSERT INTO `warning_page` (`uid`, `user_type`, `details`, `operator`, `affected_people`, `warning_given`, `total_warning`, `banned`) VALUES
(1, 'admin', '系統安全性警告,偵測到SQL攻擊: SELECT ......', 'AUTOMATIC', 's1210130', '1', 1, '0'),
(2, 'admin', '登入警告,密碼錯誤', 'AUTOMATIC', 's1210130', '0', 1, '0'),
(3, 'normal', '一般警告,在207中遊戲', 'AUTOMATIC', 's1210126', '0', 15, '1');

--
-- 已匯出資料表的索引
--

--
-- 資料表索引 `banned_user`
--
ALTER TABLE `banned_user`
  ADD PRIMARY KEY (`uid`);

--
-- 資料表索引 `logs`
--
ALTER TABLE `logs`
  ADD PRIMARY KEY (`uid`);

--
-- 資料表索引 `warning_page`
--
ALTER TABLE `warning_page`
  ADD PRIMARY KEY (`uid`);

--
-- 在匯出的資料表使用 AUTO_INCREMENT
--

--
-- 使用資料表 AUTO_INCREMENT `banned_user`
--
ALTER TABLE `banned_user`
  MODIFY `uid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;
--
-- 使用資料表 AUTO_INCREMENT `logs`
--
ALTER TABLE `logs`
  MODIFY `uid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=77;
--
-- 使用資料表 AUTO_INCREMENT `warning_page`
--
ALTER TABLE `warning_page`
  MODIFY `uid` int(11) NOT NULL AUTO_INCREMENT COMMENT 'UID', AUTO_INCREMENT=4;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
